; domain
(define (domain dragonfly)

    ;remove requirements that are not needed
    ;(:requirements :strips)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        lilypad - object
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (alighted ?x - lilypad)
    )
    (:functions
        (north)
        (east)
        (up)
        (pad_north ?l - lilypad)
        (pad_east ?l - lilypad)
        (pad_up ?l - lilypad)
        (nectar-level)
        (nectar-level-full)
        (min_north)
        (max_north)
        (min_east)
        (max_east)
        (min_up)
        (max_up)
    )

    (:action fly_north
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (north) (- (max_north) 1))
        )
        :effect (and (increase (north) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_south
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (north) (+ (min_north) 1))
        )
        :effect (and (decrease (north) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_east
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (east) (- (max_east) 1))
        )
        :effect (and (increase (east) 1)
            (decrease (nectar-level) 1)
        )
    )
    (:action fly_west
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (east) (+ (min_east) 1))
        )
        :effect (and (decrease (east) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_up
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (up) (- (max_up) 1))
        )
        :effect (and (increase (up) 1)
            (decrease (nectar-level) 1)
        )
    )
    (:action fly_down
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (up) (+ (min_up) 1))
        )
        :effect (and (decrease (up) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action alight
        :parameters (?l - lilypad)
        :precondition (and
            (>= (nectar-level) 1)
            (= (pad_north ?l) (north))
            (= (pad_east ?l) (east))
            (= (pad_up ?l) (up))
        )
        :effect (and (alighted ?l)
            (decrease (nectar-level) 1))
    )

    (:action refuel_nectar
        :parameters ()
        :precondition (and
            (= (north) 0)
            (= (east) 0)
            (= (up) 0)
        )
        :effect (and
            (assign (nectar-level) (nectar-level-full)))
    )

)

; problem
;;Instance with 8x1x2 points
(define (problem name) (:domain dragonfly)
(:objects
pad_0_0_0 - lilypad
pad_0_0_1 - lilypad
pad_1_0_0 - lilypad
pad_1_0_1 - lilypad
pad_2_0_0 - lilypad
pad_2_0_1 - lilypad
pad_3_0_0 - lilypad
pad_3_0_1 - lilypad
pad_4_0_0 - lilypad
pad_4_0_1 - lilypad
pad_5_0_0 - lilypad
pad_5_0_1 - lilypad
pad_6_0_0 - lilypad
pad_6_0_1 - lilypad
pad_7_0_0 - lilypad
pad_7_0_1 - lilypad
)
(:init (= (north) 0) (= (east) 0) (= (up) 0)
 (= (min_north) 0)  (= (max_north) 8)
 (= (min_east) 0)  (= (max_east) 1)
 (= (min_up) 0)  (= (max_up) 2)
(= (pad_north pad_0_0_0) 0)
(= (pad_east pad_0_0_0) 0)
(= (pad_up pad_0_0_0) 0)
(= (pad_north pad_0_0_1) 0)
(= (pad_east pad_0_0_1) 0)
(= (pad_up pad_0_0_1) 1)
(= (pad_north pad_1_0_0) 1)
(= (pad_east pad_1_0_0) 0)
(= (pad_up pad_1_0_0) 0)
(= (pad_north pad_1_0_1) 1)
(= (pad_east pad_1_0_1) 0)
(= (pad_up pad_1_0_1) 1)
(= (pad_north pad_2_0_0) 2)
(= (pad_east pad_2_0_0) 0)
(= (pad_up pad_2_0_0) 0)
(= (pad_north pad_2_0_1) 2)
(= (pad_east pad_2_0_1) 0)
(= (pad_up pad_2_0_1) 1)
(= (pad_north pad_3_0_0) 3)
(= (pad_east pad_3_0_0) 0)
(= (pad_up pad_3_0_0) 0)
(= (pad_north pad_3_0_1) 3)
(= (pad_east pad_3_0_1) 0)
(= (pad_up pad_3_0_1) 1)
(= (pad_north pad_4_0_0) 4)
(= (pad_east pad_4_0_0) 0)
(= (pad_up pad_4_0_0) 0)
(= (pad_north pad_4_0_1) 4)
(= (pad_east pad_4_0_1) 0)
(= (pad_up pad_4_0_1) 1)
(= (pad_north pad_5_0_0) 5)
(= (pad_east pad_5_0_0) 0)
(= (pad_up pad_5_0_0) 0)
(= (pad_north pad_5_0_1) 5)
(= (pad_east pad_5_0_1) 0)
(= (pad_up pad_5_0_1) 1)
(= (pad_north pad_6_0_0) 6)
(= (pad_east pad_6_0_0) 0)
(= (pad_up pad_6_0_0) 0)
(= (pad_north pad_6_0_1) 6)
(= (pad_east pad_6_0_1) 0)
(= (pad_up pad_6_0_1) 1)
(= (pad_north pad_7_0_0) 7)
(= (pad_east pad_7_0_0) 0)
(= (pad_up pad_7_0_0) 0)
(= (pad_north pad_7_0_1) 7)
(= (pad_east pad_7_0_1) 0)
(= (pad_up pad_7_0_1) 1)
(= (nectar-level) 23)
(= (nectar-level-full) 23)
)
(:goal (and
(alighted pad_0_0_0)
(alighted pad_0_0_1)
(alighted pad_1_0_0)
(alighted pad_1_0_1)
(alighted pad_2_0_0)
(alighted pad_2_0_1)
(alighted pad_3_0_0)
(alighted pad_3_0_1)
(alighted pad_4_0_0)
(alighted pad_4_0_1)
(alighted pad_5_0_0)
(alighted pad_5_0_1)
(alighted pad_6_0_0)
(alighted pad_6_0_1)
(alighted pad_7_0_0)
(alighted pad_7_0_1)
(= (north) 0) (= (east) 0) (= (up) 0) ))
);; end of the problem instance

; plan
1. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 23 to 22
   goals met: 2 of 19
2. (fly_north)
   changed: (north) from 1 to 2, (nectar-level) from 22 to 21
   goals met: 2 of 19
3. (fly_north)
   changed: (north) from 2 to 3, (nectar-level) from 21 to 20
   goals met: 2 of 19
4. (alight pad_3_0_0)
   added: (alighted pad_3_0_0)
   changed: (nectar-level) from 20 to 19
   goals met: 3 of 19
5. (fly_up)
   changed: (up) from 0 to 1, (nectar-level) from 19 to 18
   goals met: 2 of 19
6. (alight pad_3_0_1)
   added: (alighted pad_3_0_1)
   changed: (nectar-level) from 18 to 17
   goals met: 3 of 19
7. (fly_north)
   changed: (north) from 3 to 4, (nectar-level) from 17 to 16
   goals met: 3 of 19
8. (fly_down)
   changed: (up) from 1 to 0, (nectar-level) from 16 to 15
   goals met: 4 of 19
9. (alight pad_4_0_0)
   added: (alighted pad_4_0_0)
   changed: (nectar-level) from 15 to 14
   goals met: 5 of 19
10. (fly_up)
   changed: (up) from 0 to 1, (nectar-level) from 14 to 13
   goals met: 4 of 19
11. (alight pad_4_0_1)
   added: (alighted pad_4_0_1)
   changed: (nectar-level) from 13 to 12
   goals met: 5 of 19
12. (fly_south)
   changed: (north) from 4 to 3, (nectar-level) from 12 to 11
   goals met: 5 of 19
13. (fly_south)
   changed: (north) from 3 to 2, (nectar-level) from 11 to 10
   goals met: 5 of 19
14. (fly_down)
   changed: (up) from 1 to 0, (nectar-level) from 10 to 9
   goals met: 6 of 19
15. (alight pad_2_0_0)
   added: (alighted pad_2_0_0)
   changed: (nectar-level) from 9 to 8
   goals met: 7 of 19
16. (fly_up)
   changed: (up) from 0 to 1, (nectar-level) from 8 to 7
   goals met: 6 of 19
17. (alight pad_2_0_1)
   added: (alighted pad_2_0_1)
   changed: (nectar-level) from 7 to 6
   goals met: 7 of 19
18. (fly_south)
   changed: (north) from 2 to 1, (nectar-level) from 6 to 5
   goals met: 7 of 19
19. (alight pad_1_0_1)
   added: (alighted pad_1_0_1)
   changed: (nectar-level) from 5 to 4
   goals met: 8 of 19
20. (fly_down)
   changed: (up) from 1 to 0, (nectar-level) from 4 to 3
   goals met: 9 of 19
21. (alight pad_1_0_0)
   added: (alighted pad_1_0_0)
   changed: (nectar-level) from 3 to 2
   goals met: 10 of 19
22. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 2 to 1
   goals met: 11 of 19
23. (refuel_nectar)
   changed: (nectar-level) from 1 to 23
   goals met: 11 of 19
24. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 23 to 22
   goals met: 10 of 19
25. (fly_north)
   changed: (north) from 1 to 2, (nectar-level) from 22 to 21
   goals met: 10 of 19
26. (fly_north)
   changed: (north) from 2 to 3, (nectar-level) from 21 to 20
   goals met: 10 of 19
27. (fly_north)
   changed: (north) from 3 to 4, (nectar-level) from 20 to 19
   goals met: 10 of 19
28. (fly_north)
   changed: (north) from 4 to 5, (nectar-level) from 19 to 18
   goals met: 10 of 19
29. (alight pad_5_0_0)
   added: (alighted pad_5_0_0)
   changed: (nectar-level) from 18 to 17
   goals met: 11 of 19
30. (fly_up)
   changed: (up) from 0 to 1, (nectar-level) from 17 to 16
   goals met: 10 of 19
31. (alight pad_5_0_1)
   added: (alighted pad_5_0_1)
   changed: (nectar-level) from 16 to 15
   goals met: 11 of 19
32. (fly_north)
   changed: (north) from 5 to 6, (nectar-level) from 15 to 14
   goals met: 11 of 19
33. (fly_down)
   changed: (up) from 1 to 0, (nectar-level) from 14 to 13
   goals met: 12 of 19
34. (alight pad_6_0_0)
   added: (alighted pad_6_0_0)
   changed: (nectar-level) from 13 to 12
   goals met: 13 of 19
35. (fly_up)
   changed: (up) from 0 to 1, (nectar-level) from 12 to 11
   goals met: 12 of 19
36. (alight pad_6_0_1)
   added: (alighted pad_6_0_1)
   changed: (nectar-level) from 11 to 10
   goals met: 13 of 19
37. (fly_south)
   changed: (north) from 6 to 5, (nectar-level) from 10 to 9
   goals met: 13 of 19
38. (fly_south)
   changed: (north) from 5 to 4, (nectar-level) from 9 to 8
   goals met: 13 of 19
39. (fly_south)
   changed: (north) from 4 to 3, (nectar-level) from 8 to 7
   goals met: 13 of 19
40. (fly_south)
   changed: (north) from 3 to 2, (nectar-level) from 7 to 6
   goals met: 13 of 19
41. (fly_south)
   changed: (north) from 2 to 1, (nectar-level) from 6 to 5
   goals met: 13 of 19
42. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 5 to 4
   goals met: 14 of 19
43. (alight pad_0_0_1)
   added: (alighted pad_0_0_1)
   changed: (nectar-level) from 4 to 3
   goals met: 15 of 19
44. (fly_down)
   changed: (up) from 1 to 0, (nectar-level) from 3 to 2
   goals met: 16 of 19
45. (alight pad_0_0_0)
   added: (alighted pad_0_0_0)
   changed: (nectar-level) from 2 to 1
   goals met: 17 of 19
46. (refuel_nectar)
   changed: (nectar-level) from 1 to 23
   goals met: 17 of 19
47. (fly_north)
   changed: (north) from 0 to 1, (nectar-level) from 23 to 22
   goals met: 16 of 19
48. (fly_north)
   changed: (north) from 1 to 2, (nectar-level) from 22 to 21
   goals met: 16 of 19
49. (fly_north)
   changed: (north) from 2 to 3, (nectar-level) from 21 to 20
   goals met: 16 of 19
50. (fly_north)
   changed: (north) from 3 to 4, (nectar-level) from 20 to 19
   goals met: 16 of 19
51. (fly_north)
   changed: (north) from 4 to 5, (nectar-level) from 19 to 18
   goals met: 16 of 19
52. (fly_north)
   changed: (north) from 5 to 6, (nectar-level) from 18 to 17
   goals met: 16 of 19
53. (fly_north)
   changed: (north) from 6 to 7, (nectar-level) from 17 to 16
   goals met: 16 of 19
54. (alight pad_7_0_0)
   added: (alighted pad_7_0_0)
   changed: (nectar-level) from 16 to 15
   goals met: 17 of 19
55. (fly_up)
   changed: (up) from 0 to 1, (nectar-level) from 15 to 14
   goals met: 16 of 19
56. (alight pad_7_0_1)
   added: (alighted pad_7_0_1)
   changed: (nectar-level) from 14 to 13
   goals met: 17 of 19
57. (fly_south)
   changed: (north) from 7 to 6, (nectar-level) from 13 to 12
   goals met: 17 of 19
58. (fly_south)
   changed: (north) from 6 to 5, (nectar-level) from 12 to 11
   goals met: 17 of 19
59. (fly_south)
   changed: (north) from 5 to 4, (nectar-level) from 11 to 10
   goals met: 17 of 19
60. (fly_south)
   changed: (north) from 4 to 3, (nectar-level) from 10 to 9
   goals met: 17 of 19
61. (fly_south)
   changed: (north) from 3 to 2, (nectar-level) from 9 to 8
   goals met: 17 of 19
62. (fly_south)
   changed: (north) from 2 to 1, (nectar-level) from 8 to 7
   goals met: 17 of 19
63. (fly_south)
   changed: (north) from 1 to 0, (nectar-level) from 7 to 6
   goals met: 18 of 19
64. (fly_down)
   changed: (up) from 1 to 0, (nectar-level) from 6 to 5
   goals met: 19 of 19
